DeviceEvents
| where Timestamp > ago(30d)
| where ActionType in ('AsrVulnerableSignedDriverAudited', 'AsrVulnerableSignedDriverBlocked')
| project ActionType, ReportId, Timestamp, DeviceId, DeviceName, SHA256, FileName, FolderPath,
    ProcessSHA256 = InitiatingProcessSHA256, 
    ProcessName = InitiatingProcessFileName, 
    SourceUser = InitiatingProcessAccountName, 
    SourceUserId = InitiatingProcessAccountObjectId, 
    SourceUserSid = InitiatingProcessAccountSid,
    AdditionalFields