DeviceEvents
| where Timestamp > ago(24h)
| where ActionType in ('AsrOfficeMacroWin32ApiCallsAudited', 'AsrOfficeMacroWin32ApiCallsBlocked')
| project ActionType, ReportId, Timestamp, DeviceId, DeviceName, SHA256, FileName, FolderPath, 
    ProcessSHA256 = InitiatingProcessSHA256, 
    ProcessName = InitiatingProcessFileName, 
    SourceUser = InitiatingProcessAccountName, 
    SourceUserId = InitiatingProcessAccountObjectId, 
    SourceUserSid = InitiatingProcessAccountSid,
    AdditionalFields